let api = [
    {
        "id": "100029",
        "name": "أحمد جمال أحمد سلامة",
        "score": 607.8,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100030",
        "name": "أحمد حسن أحمد محمد",
        "score": 580.6,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100031",
        "name": "أحمد خالد حسين حسن",
        "score": 615.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100032",
        "name": "أحمد سامى حسن عوض",
        "score": 596.4,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100033",
        "name": "أحمد سعدى حسن الشربينى",
        "score": 601.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100034",
        "name": "أحمد عبدالعزيز عبدالرحيم سليمان",
        "score": 616.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100035",
        "name": "أحمد محمد أحمد كامل",
        "score": 608.4,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100036",
        "name": "أحمد مصطفى محمد على",
        "score": 623.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100037",
        "name": "أحمد هانى حسن محمد",
        "score": 611.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100038",
        "name": "أحمد يحيى محمد حسن",
        "score": 615.8,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100039",
        "name": "أمانى عبدالله محمود محمد",
        "score": 607.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100040",
        "name": "أميرة محمد عبدالعزيز عبدالحميد",
        "score": 603.9,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100041",
        "name": "إبراهيم عبدالعظيم إبراهيم محمد",
        "score": 599.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100042",
        "name": "إيمان محمود عبدالعزيز عبدالمجيد",
        "score": 617.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100043",
        "name": "إيناس مصطفى شحاتة عبدالسلام",
        "score": 602.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100044",
        "name": "أيناس محمد عبدالمنعم عبدالحميد",
        "score": 620.1,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100045",
        "name": "باسم مصطفى أحمد قاسم",
        "score": 589.6,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100046",
        "name": "بدرية محمد عبدالعزيز حجازى",
        "score": 609.7,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100047",
        "name": "بشير عبدالسلام عبدالرحمن حسين",
        "score": 614.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100048",
        "name": "توفيق عبدالعزيز توفيق محمد",
        "score": 596.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100049",
        "name": "جمال عبدالجواد أحمد",
        "score": 607.6,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100050",
        "name": "جمال محمود محمد احمد",
        "score": 610.3,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100051",
        "name": "جمال محمد مصطفى عبدالجواد",
        "score": 605.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100052",
        "name": "جمال محمد يوسف محمد",
        "score": 618.6,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100053",
        "name": "جميلة محمد علي مصطفى",
        "score": 595.4,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100054",
        "name": "جودى محمد حسن عبدالرؤوف",
        "score": 596.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100055",
        "name": "حامد محمد حسين الصعيدى",
        "score": 605.8,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100056",
        "name": "حسام الدين محمد حسام الدين",
        "score": 608.9,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100057",
        "name": "حسن أحمد محمود حسن",
        "score": 606.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100058",
        "name": "حسن محمد حسانين حسن",
        "score": 611.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100059",
        "name": "حسين محمد مصطفى أحمد",
        "score": 613.1,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100060",
        "name": "حسام الدين عبدالعزيز حسن",
        "score": 603.7,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100061",
        "name": "حسين سامى عطيه",
        "score": 600.4,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100062",
        "name": "حسين عبدالحكيم عويس",
        "score": 605.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100063",
        "name": "خالد توفيق عبدالسلام عبدالسلام",
        "score": 599.8,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100064",
        "name": "خالد محمد عبدالعزيز",
        "score": 614.3,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100065",
        "name": "خالد محمد يوسف",
        "score": 616.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100066",
        "name": "خالد هاشم عبدالعزيز",
        "score": 612.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100067",
        "name": "خديجة أحمد محمد",
        "score": 605.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100068",
        "name": "خديجة محمد سعيد",
        "score": 597.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100069",
        "name": "داليا محمد عادل",
        "score": 605.6,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100070",
        "name": "دينا أحمد محمد عادل",
        "score": 610.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100071",
        "name": "دينا أحمد محمد عبدالسلام",
        "score": 601.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100072",
        "name": "دينا محمد أحمد حسين",
        "score": 612.8,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100073",
        "name": "رامى أحمد مصطفى",
        "score": 590.9,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100074",
        "name": "رامى محمد سامى",
        "score": 611.7,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100075",
        "name": "رامى مصطفى محمد",
        "score": 603.3,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100076",
        "name": "رانيا أحمد يوسف",
        "score": 595.6,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100077",
        "name": "رانيا حسن محمد",
        "score": 609.1,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100078",
        "name": "رانيا محمود محمد",
        "score": 620.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100079",
        "name": "ريمون سامى شفيق",
        "score": 600.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100080",
        "name": "زكريا عبدالعزيز زكريا",
        "score": 612.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100081",
        "name": "زينب محمد مصطفى",
        "score": 605.9,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100082",
        "name": "سارة محمد سعيد",
        "score": 603.1,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100083",
        "name": "سارة يوسف عبدالعزيز",
        "score": 608.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100084",
        "name": "سلوى حسين عبدالرزاق",
        "score": 606.3,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100085",
        "name": "سوسن محمد عادل",
        "score": 613.4,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100086",
        "name": "سعاد عبدالغفار",
        "score": 599.9,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100087",
        "name": "سعيد محمد حسن",
        "score": 607.4,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100088",
        "name": "سعيد محمد حسين",
        "score": 603.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100089",
        "name": "سيد محمود عبدالسلام",
        "score": 605.1,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100090",
        "name": "شادى محمود مصطفى",
        "score": 598.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100091",
        "name": "شيماء محمود محمد",
        "score": 610.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100092",
        "name": "شيماء محمد عبدالعزيز",
        "score": 602.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100093",
        "name": "صابرين مصطفى محمد",
        "score": 597.8,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100094",
        "name": "صابرين محمد عبدالعزيز",
        "score": 609.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100095",
        "name": "صبرى عبدالعظيم محمد",
        "score": 613.6,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100096",
        "name": "صفاء عبدالمجيد محمد",
        "score": 606.7,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100097",
        "name": "صفاء محمود حسين",
        "score": 611.8,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100098",
        "name": "صفاء محمد عادل",
        "score": 612.9,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100099",
        "name": "عادل محمد حسين",
        "score": 601.6,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100100",
        "name": "عادل محمد عبدالعزيز",
        "score": 618.8,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100101",
        "name": "عادل مصطفى عبدالعظيم",
        "score": 596.8,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100102",
        "name": "عادل مصطفى محمد",
        "score": 611.3,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100103",
        "name": "عادل مصطفى محمد",
        "score": 606.1,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100104",
        "name": "عادل محمود مصطفى",
        "score": 605.9,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100105",
        "name": "عادل محمود حسين",
        "score": 609.2,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100106",
        "name": "عادل محمود عبدالعزيز",
        "score": 615.0,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100107",
        "name": "عادل محمود عبدالعظيم",
        "score": 607.3,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100108",
        "name": "عادل محمود على",
        "score": 603.5,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100109",
        "name": "عادل مصطفى عبدالعظيم",
        "score": 608.4,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100110",
        "name": "عبدالسلام إبراهيم عبدالسلام",
        "score": 604.9,
        "status": "ناجح دور أول",
        "group": 3
    },
    {
        "id": "100111",
        "name": "عبدالعزيز محمد عبدالسلام",
        "score": 613.9,
        "status": "ناجح دور أول",
        "group": 3
    }]

let tablee = document.querySelector('#tbody');
let header = document.createElement('tr');
tablee.style.width = '90%';
header.innerHTML = `
    <th>id</th>
    <th>score</th>
    <th>status</th>
    <th>group</th>
    <th>name</th>
    `
tablee.appendChild(header);

        // التحقق من وجود بيانات
        if (api.length > 0) {
            api.forEach(ap => {
                let row = document.createElement('tr');
                row.innerHTML = `
                    <td>${ap.id}</td>
                    <td>${ap.score}</td>
                    <td>${ap.status}</td>
                    <td>${ap.group}</td>
                    <td>${ap.name}</td>
                `;
                tablee.appendChild(row);
            });
        }